spcalendarpro.min.js

/*
* @name SPCalendarPro
* Version 2018.02
* No dependencies!
* @description An ultra lightweight JavaScript library to easily manage SharePoint calendar events.
* @category Plugins/SPCalendarPro
* @author Sam Perrow sam.perrow399@gmail.com
*
* Copyright 2018  Sam Perrow  (email : sam.perrow399@gmail.com)
* Licensed under the MIT license:
* http://www.opensource.org/licenses/mit-license.php
*/

<<<<<<< HEAD
!function(e,t){e.spcalpro=function(){function e(e,t){return{beginDateTime:e,beginDate:new Date(e.toDateString()),beginTime:e.toTimeString(),endDateTime:t,endDate:new Date(t.toDateString()),endTime:t.toTimeString()}}n.prototype.isSameDate=function(){var e=this.userDateTimes.beginDate,t=this.userDateTimes.endDate;return this.listData=this.listData.filter(function(r){return r.EventDate.toDateString()===e&&r.EndDate.toDateString()===t}),this},n.prototype.matchDateTimes=function(){var e=this.userDateTimes.beginDateTime,t=this.userDateTimes.endDateTime;return this.listData=this.listData.filter(function(r){return r.EventDate<=e&&r.EndDate>=t}),this},n.prototype.isTimeConflict=function(){var e=this.userDateTimes.beginDateTime,t=this.userDateTimes.endDateTime;return this.listData=this.listData.filter(function(r){var n=r.EventDate,a=r.EndDate;return e<=n&&t>=a||n<e&&a>e||n<t&&a>t||e<n&&t>a}),this},n.prototype.where=function(e){var t=e.split(" ")[0],r=e.split(" ")[1],n=e.split(" ")[2],a={"=":function(e,t){return e==t},">":function(e,t){return e>new Number(t)},"<":function(e,t){return e<new Number(t)},">=":function(e,t){return e>=new Number(t)},"<=":function(e,t){return e<=new Number(t)},"!=":function(e,t){return e!=t}};return this.listData=this.listData.filter(function(e){return a[r](e[t],n)}),this},n.prototype.getDateTimesFromForm=function(t,n){var a=r(t,n);return this.userDateTimes=e(a.userBeginDT,a.userEndDT),this},n.prototype.getEventsAfterToday=function(){return this.listData=this.listData.filter(function(e){var t=new Date;return e.EventDate>=t||e.EndDate>=t}),this},n.prototype.provideDateTimes=function(t,r){return this.userDateTimes=e(t,r),this};var t=function(e,t,r,n){var a,i,s=void 0===t||void 0===typeof t||t,o="<soap:Envelope xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'><soap:Body><GetListItems xmlns='http://schemas.microsoft.com/sharepoint/soap/'><listName>"+e.listName+"</listName>",u="<DateRangesOverlap><FieldRef Name='EventDate'/><FieldRef Name='EndDate'/><FieldRef Name='RecurrenceID'/><Value Type='DateTime'><Year/></Value></DateRangesOverlap>",l="</Where><OrderBy><FieldRef Name='EventDate'/></OrderBy></Query></query><queryOptions><QueryOptions><RecurrencePatternXMLVersion>v3</RecurrencePatternXMLVersion><ExpandRecurrence>TRUE</ExpandRecurrence><RecurrenceOrderBy>TRUE</RecurrenceOrderBy><ViewAttributes Scope='RecursiveAll'/></QueryOptions></queryOptions></GetListItems>",c="",m=e.fields?function(){for(var t="",r=0;r<e.fields.length;r++)t+="<FieldRef Name='"+e.fields[r]+"'/>";return t}():"";function p(t){return 500==t.status?e.error={errorCode:t.responseText.split('<errorcode xmlns="http://schemas.microsoft.com/sharepoint/soap/">')[1].split("</errorcode>")[0],errorString:t.responseText.split('<errorstring xmlns="http://schemas.microsoft.com/sharepoint/soap/">')[1].split("</errorstring>")[0],faultString:t.responseText.split("<faultstring>")[1].split("</faultstring>")[0]}:e.error="Request failed."}function d(t){if(4==t.readyState&&200==t.status)return e.listData=function(t){for(var r=[],a=0;a<t.length;a++){var i={},s=t[a].attributes;if("z:row"===t[a].nodeName){for(var o=0;o<s.length;o++){var u=s[o].name.split("ows_")[1];i[u]="EventDate"===u||"EndDate"===u?new Date(s[o].value.replace("-","/")):s[o].value}"calendar"===n&&e.getEventsAfterDate?i.EventDate>=e.getEventsAfterDate&&r.push(i):r.push(i)}}return r}(t.responseXML.querySelectorAll("*")),e.callback(e);p(t)}return"calendar"===n?c="single"===r?"<query><Query><Where><Eq><FieldRef Name='fRecurrence'/><Value Type='Number'>0</Value></Eq></Where>/Query></query></GetListItems>":"recurring"===r?"<query><Query><Where><And><DateRangesOverlap><FieldRef Name='EventDate'/><FieldRef Name='EndDate'/><FieldRef Name='RecurrenceID'/><Value Type='DateTime'><Year/></Value></DateRangesOverlap><Eq><FieldRef Name='fRecurrence'/><Value Type='Number'>1</Value></Eq></And></Where><OrderBy><FieldRef Name='EventDate'/></OrderBy></Query></query><queryOptions><QueryOptions><RecurrencePatternXMLVersion>v3</RecurrencePatternXMLVersion><ExpandRecurrence>TRUE</ExpandRecurrence><RecurrenceOrderBy>TRUE</RecurrenceOrderBy><ViewAttributes Scope='RecursiveAll'/></QueryOptions></queryOptions></GetListItems>":"<query><Query><Where>"+u+l:"list"===n&&(c="<viewFields><ViewFields>"+m+"</ViewFields></viewFields></GetListItems>"),a=o+c+"</soap:Body></soap:Envelope>",(i=new XMLHttpRequest).open("POST",e.SPInfo.soapURL,s),i.setRequestHeader("X-Requested-With","XMLHttpRequest"),i.setRequestHeader("Content-Type",'text/xml;charset="utf-8"'),i.send(a),i.onerror=function(){p(i)},!0===s?i.onload=function(){return d(i)}:d(i),e.listData};String.prototype.formatInputToHours=function(){var e=this.split(" "),t=Number(e[0]);return"PM"===e[1]&&t<12?t+=12:t};var r=function(e,t){function r(e){var t=document.querySelectorAll('input[id$="DateTimeField_DateTimeFieldDate"]')[e].parentNode.parentNode,r=t.getElementsByClassName("ms-dttimeinput")[0];if(r)var n=r.getElementsByTagName("select")[0].value,a=r.getElementsByTagName("select")[1].value;return{date:t.getElementsByTagName("td")[0].getElementsByTagName("input")[0].value,time:function(){return n&&a?n.formatInputToHours()+":"+a:""}}}e=e||0,t=t||1;var n=r(e),a=r(t);return{userBeginDT:new Date(n.date+" "+n.time()),userEndDT:new Date(a.date+" "+a.time())}};function n(e,r){var n,a;return this.listName=e.listName,this.userDateTimes={},this.SPInfo=(n=e.sourceSite,{year:15===(a=_spPageContextInfo.webUIVersion)?"2013":"2010",soapURL:n?n+"/_vti_bin/Lists.asmx":15===a?_spPageContextInfo.webAbsoluteUrl+"/_vti_bin/Lists.asmx":document.location.protocol+"//"+document.location.host+_spPageContextInfo.webServerRelativeUrl+"/_vti_bin/Lists.asmx"}),this.getEventsAfterDate=!!e.getEventsAfterDate&&e.getEventsAfterDate,this.fields=e.fields?e.fields:null,this.listData=t(this,e.async,e.type,r),this.callback=function(){return e.callback?e.callback(this):null},this}return{getCalendarEvents:function(e){return new n(e,"calendar")},getListItems:function(e){return new n(e,"list")},getDateTimesFromForm:function(t,n){var a=r(t,n);return e(a.userBeginDT,a.userEndDT)},disableDragAndDrop:function(){ExecuteOrDelayUntilScriptLoaded(function(){var e=SP.UI.ApplicationPages.CalendarContainerFactory.create;SP.UI.ApplicationPages.CalendarContainerFactory.create=function(t,r,n,a,i){if(r.dataSources&&r.dataSources instanceof Array&&r.dataSources.length>0)for(var s=0;s<r.dataSources.length;s++)r.dataSources[s].disableDrag=!0;e(t,r,n,a,i)}},"SP.UI.ApplicationPages.Calendar.js")}}}()}(this);
=======
!function(e,t){e.spcalpro=function(){function e(e,t){return{beginDateTime:e,beginDate:e.toDateString(),beginTime:e.toTimeString(),endDateTime:t,endDate:t.toDateString(),endTime:t.toTimeString()}}r.prototype.isSameDate=function(){var e=this.userDateTimes.startDate,t=this.userDateTimes.endDate;return this.events=this.events.filter(function(n){return new Date(n.EventDate).toDateString()===e&&new Date(n.EndDate).toDateString()===t}),this},r.prototype.matchDateTimes=function(){var e=this.userDateTimes.startDateTime,t=this.userDateTimes.endDateTime;return this.events=this.events.filter(function(n){return new Date(n.EventDate)<=e&&new Date(n.EndDate)>=t}),this},r.prototype.isTimeConflict=function(){var e=this.userDateTimes.startDateTime,t=this.userDateTimes.endDateTime;return this.events=this.events.filter(function(n){var r=n.EventDate,a=n.EndDate;return e<=r&&t>=a||r<e&&a>e||r<t&&a>t||e<r&&t>a}),this},r.prototype.where=function(e){var t=e.split(" ")[0],n=e.split(" ")[1],r=e.split(" ")[2],a={"=":function(e,t){return e==t},">":function(e,t){return e>new Number(t)},"<":function(e,t){return e<new Number(t)},">=":function(e,t){return e>=new Number(t)},"<=":function(e,t){return e<=new Number(t)},"!=":function(e,t){return e!=t}};return this.events=this.events.filter(function(e){return a[n](e[t],r)}),this},r.prototype.getDateTimesFromForm=function(t,r){var a=n(t,r);return this.userDateTimes=e(a.userBeginDT,a.userEndDT),this},r.prototype.getEventsAfterToday=function(){return this.events=this.events.filter(function(e){var t=new Date;return e.EventDate>=t||e.EndDate>=t}),this},r.prototype.provideDateTimes=function(t,n){return this.userDateTimes=e(t,n),this};var t=function(e,t,n){var r="<soap:Envelope xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'><soap:Body><GetListItems xmlns='http://schemas.microsoft.com/sharepoint/soap/'><listName>"+e.listName+"</listName>",a="<DateRangesOverlap><FieldRef Name='EventDate'/><FieldRef Name='EndDate'/><FieldRef Name='RecurrenceID'/><Value Type='DateTime'><Year/></Value></DateRangesOverlap>",i="</Where><OrderBy><FieldRef Name='EventDate'/></OrderBy></Query></query><queryOptions><QueryOptions><RecurrencePatternXMLVersion>v3</RecurrencePatternXMLVersion><ExpandRecurrence>TRUE</ExpandRecurrence><RecurrenceOrderBy>TRUE</RecurrenceOrderBy><ViewAttributes Scope='RecursiveAll'/></QueryOptions></queryOptions></GetListItems>",s=r+("single"===n?"<query><Query><Where><Eq><FieldRef Name='fRecurrence'/><Value Type='Number'>0</Value></Eq></Where></Query></query></GetListItems>":"recurring"===n?"<query><Query><Where><And>"+a+"<Eq><FieldRef Name='fRecurrence'/><Value Type='Number'>1</Value></Eq></And>"+i:"<query><Query><Where>"+a+i)+"</soap:Body></soap:Envelope>";return function(n){var r=e.soapUrl,a=new XMLHttpRequest;function i(){if(4==a.readyState&&200==a.status)return e.events=function(e){for(var t=[],n=0;n<e.length;n++){var r={},a=e[n].attributes;if("z:row"===e[n].nodeName){for(var i=0;i<a.length;i++){var s=a[i].name,u=s.split("ows_")[1];r[u]="EventDate"===u||"EndDate"===u?new Date(a[i].value.replace("-","/")):a[i].value}t.push(r)}}return t}(a.responseXML.querySelectorAll("*")),e.callback?e.callback(e):e}a.open("POST",r,t),a.setRequestHeader("X-Requested-With","XMLHttpRequest"),a.setRequestHeader("Content-Type",'text/xml;charset="utf-8"'),a.send(n),!0===t?a.onload=function(){i()}:i()}(s),e.events};String.prototype.formatInputToHours=function(){var e=this.split(" "),t=Number(e[0]);return"PM"===e[1]&&t<12?t+=12:t};var n=function(e,t){function n(e){var t=document.querySelectorAll('input[id$="DateTimeField_DateTimeFieldDate"]')[e].parentNode.parentNode,n=t.getElementsByClassName("ms-dttimeinput")[0];if(n)var r=n.getElementsByTagName("select")[0].value,a=n.getElementsByTagName("select")[1].value;return{date:t.getElementsByTagName("td")[0].getElementsByTagName("input")[0].value,time:function(){return r&&a?r.formatInputToHours()+":"+a:""}}}e=e||0,t=t||1;var r=n(e),a=n(t);return{userBeginDT:new Date(r.date+" "+r.time()),userEndDT:new Date(a.date+" "+a.time())}};function r(e){return this.listName=e.listName,this.userDateTimes={},this.soapUrl=e.sourceSite?e.sourceSite+"/_vti_bin/Lists.asmx":function(){var e={};15===_spPageContextInfo.webUIVersion?(e.year="2013",e.soapURL=_spPageContextInfo.webAbsoluteUrl+"/_vti_bin/Lists.asmx"):(e.year="2010",e.soapURL=document.location.protocol+"//"+document.location.host+_spPageContextInfo.webServerRelativeUrl+"/_vti_bin/Lists.asmx");return e}().soapURL,this.callback=function(){return e.callback?e.callback(this):null},this.events=t(this,e.async,e.type),this}return{getEvents:function(e){return new r(e)},getDateTimesFromForm:function(t,r){var a=n(t,r);return e(a.userBeginDT,a.userEndDT)}}}()}(this);
>>>>>>> update
